window.TRH = {

  SwordStyle: {
    '1': '安綱',
    '2': '三条',
    '3': '三池',
    '4': '青江',
    '5': '粟田口',
    '6': '古備前',
    '7': '来',
    '8': '村正',
    '9': '貞宗',
    '10': '長船',
    '11': '左文字',
    '12': '兼定',
    '13': '堀川',
    '14': '虎徹',
    '15': '虎徹…？'
  },

  SwordType: {
    '0': '全て',
    '1': '短刀',
    '2': '脇差',
    '3': '打刀',
    '4': '太刀',
    '5': '大太刀',
    '6': '槍',
    '7': '薙刀'
  },

  SwordRange: {
    '1': '狭',
    '2': '狭',
    '3': '狭',
    '4': '狭',
    '5': '広',
    '6': '縦',
    '7': '横'
  },

  FATIGUE: {
    STATUS: {
      NONE:       0,
      TIERD:      1,
      VERY_TIERD: 2
    },
    VALUE: {
      VERY_TIERD:  8,
      TIERD:      20,
      NOMAL:      49,
      MAX:       100
    }
  }

}